module Main
  module Constants

    # Example:
    #   >> PhysicsPlus.C
    #   => 299792458
    #

    # Фундаментальные физические постоянные
    def C
      299792458
    end

    def G
      6.674484 * ( 10 ** (11 * -1.0 ) )
    end

    def h
      6.62607015 * ( 10 ** (34 * -1.0 ) )
    end

    def e
      1.602176634 * ( 10 ** (19 * -1.0 ) )
    end

    def k
      1.380649 * ( 10 ** (23 * -1.0 ) )
    end

    # Постоянные, связывающие разные системы единиц, и переводные множители
    def a_e_m
      1.66053906660 * ( 10 ** (27 * -1.0 ) )
    end

    def Na
      6.02214076 * ( 10 ** (23 * 1.0 ) )
    end
    
    def eV
      1.602176634 * ( 10 ** (19 * -1.0 ) )
    end

    def kal
      4.1868
    end
  end
end